{
    "语言(Language)": "Sprache (语言)",
    "椰羊cocogoat": "Kokosziege",
    "圣遗物": "Artefakte",
    "占卜铺": "Optimierer",
    "设置": "Optionen",
    "添加": "Hinzufügen",
    "导出": "Exportieren",
    "修改": "Bearbeiten",
    "删除": "Löschen",
    "清空": "Alles löschen",
    "识别": "Erkennen",
    "确定": "JA",
    "保存": "Speichern",
    "重置": "Zurücksetzen",
    "算了": "Später",
    "删除选中": "Auswahl löschen",
    "取消选择": "Lösche Auswahl",
    "到文件": "als Datei",
    "圣遗物仓库": "Artefakte",
    "真的要清空吗？": "Bist du sicher, dass du alles löschen willst?",
    "正在打开圣遗物识别工具": "Öffne das Artefakt-Erkennungs-Tool",
    "请确保原神已经运行": "Bitte stelle sicher, dass Genshin Impact läuft.",
    "导出成功": "Daten exportiert",
    "已复制到剪贴板": "Ergebnisse in die Zwischenablage kopiert.",
    "编辑圣遗物": "Bearbeite Artefakt",
    "添加圣遗物": "Artefakt hinzufügen",
    "副词条": "Nebenattribute",
    "添加副词条": "Nebenattribut hinzufügen",
    "基础": "Basis",
    "检查更新": "Suche nach Updates",
    "已经是最新版本": "Du besitzt bereits die aktuellste Version",
    "这些选项将在程序重启后生效。": "Die unteren Optionen werden nach einem Neustart angewandt.",
    "发送错误日志，协助我们改进程序": "Sende Fehlerlogs um uns zu helfen Fehler zu beheben",
    "启用OCR识别错误反馈功能": "Zeige Feedback-Button auf der OCR-Seite",
    "这些选项将在下次打开识别器或切换器时生效。": "Die unteren Optionen werden angewandt, wenn du den Erkenner oder Wechsler das nächste mal öffnest.",
    "保留重复识别": "Behalte identische Artefakte",
    "得到两个完全一致的圣遗物的概率是多少呢？": "Aktiviere dies, wenn du Artefakte mit gleichen Attributen behalten willst.",
    "独立切换模式": "Eigenständiger Wechsler",
    "允许在关闭识别器时，保留切换器窗口以配合其他工具使用。": "Aktiviere dies, um den Wechsler eigenständig zu verwenden oder mit Drittanbietersoftware zusammenzuarbeiten.",
    "圣遗物切换器每次点击（并识别完成）后切换到下一个的间隔。": "Die Verzögerung bevor zu dem nächsten Artefakt gewechselt werden soll, nachdem eines eingescannt wurde.",
    "可用于人工检查识别准确性，或关闭识别器窗口并配合其他工具使用。": "Sinnvoll, wenn du Fehler manuell prüfen willst oder den eigenständigen Wechsler mit anderen Tools verwendest. ",
    "自动切换延迟": "Automatische Wechselverzögerung",
    "关于": "Über uns",
    "秒": "Sekunde(n)",
    "一个简单的原神工具箱，保证每一行代码都是加班打造。是半仙之兽。": "Ein einfaches Werkzeug für Genshin Impact, wobei jede Codezeile durch Überstunden entstanden ist.",
    "工作…工作还没做完…真的可以提前休息吗？": "Sollten wir wirklich so früh mit der Arbeit aufhören? Es gibt doch noch so viel zu tun...",
    "趴在草地上，能听见大地的心跳...": "Wenn man im Gras liegt, kann man den Herzschlag der Welt spüren.",
    "开发模式无法自动更新": "Auto-Upgrade ist im Entwicklermodus deaktiviert.",
    "窗口状态数据": "Fensterzustandsdaten",
    "清除保存的窗口数据": "Setze gespeicherte Fenstergröße und -position zurück",
    "这在你找不到悬浮窗时或许有用。": "Kann nützlich sein, wenn du überlappende Fenster nicht finden kannst.",
    "窗口状态数据已清除": "Erfolgreich die Fensterzustandsdaten zurückgesetzt",
    "欢迎使用椰羊cocogoat": "Willkommen bei Kokosziege",
    "这是一个简单的原神工具箱，提供圣遗物识别等便利功能。": "Dies ist ein Werkzeug für Genshin Impact mit Artefakt-Export und so weiter.",
    "在开始之前，有一些事项需要征求您的同意...": "Es gibt einiges zu überprüfen bevor wir starten können.",
    "保存后，您可以随时在设置页面更改这些选项，但需要重启程序生效。除此之外，本程序会在每次启动时自动检查新版本，但需要您手动确认才会进行更新。点击开始使用按钮，代表您同意以上内容。": "Du kannst diese Einstellungen immer nach dem speichern in den Optionen ändern, aber sie werden erst nach einem Neustart angewandt. Außerdem prüft diese Anwendung automatisch nach jedem Start auf neue Updates. Mit dem Klicken des Buttons unten bestätigst du, was hier geschrieben ist.",
    "保存并开始使用": "Speichern und starten",
    "无法确认行列数量。请确认圣遗物列表的顶部对齐某一行的顶端，且当前页不是最后一页，或换到暗处并重新打开背包。": "Kann nicht die Anzahl an Reihen und Spalten bestätigen. Bitte überprüfe, ob der Anfang der Artefaktliste mit dem Anfang der Artefaktreihe übereinstimmt und dass die aktuelle Seite nicht die letzte Seite ist oder geh zurück zu einer dunklen Stelle und öffne deinen Rucksack erneut.",
    "请确保您已经使切换器窗口恰好包围圣遗物列表区域。如始终提示出错，请提交反馈。": "Bitte stelle sicher, dass der Wechsler den Bereich der Artefaktliste passend umgibt. Wenn du immer wieder nach einem Fehler gefragt wirst, dann gebe entsprechendes Feedback.",
    "圣遗物切换器": "Artefakt-Wechsler",
    "如鼠标无法选中本窗口，请按热键(~)": "Wenn deine Maus nicht das Fenster auswählen kann, dann drücke bitte den Hotkey (~).",
    "正在检测": "Erkenne",
    "正在切换": "Wechsle",
    "正在翻页": "Seitenwechsel",
    "准备中": "Bereite vor",
    "，按热键(~)停止": ", drücke Hotkey (~) zum stoppen.",
    "检测失败": "Erkennung fehlgeschlagen",
    "当前页 %1 个  总第 %2 / %3 个": "%1 in aktueller Seite, total %2 / %3",
    "反馈识别错误": "Melde Fehler",
    "反馈识别信息将会发送以下内容到我们的服务器：": "Das Feedback wird folgenden Inhalt zu unserem Server schicken:",
    "本次抓取到的圣遗物图片": "Das Bild von diesem Artefakt",
    "您设备的屏幕分辨率和dpi": "Die Bildschirmauflösung und DPI von deinem Gerät",
    "本地OCR识别结果与纠错尝试": "Lokale OCR-Erkennungsergebnisse und Fehlerbehebungsversuche",
    "您在下方填写的备注文字信息": "Die Notiz, welche du unten ausgefüllt hast",
    "若您不主动向我们反馈，这些内容都会在识别下一个圣遗物后被删除。": "Wenn du uns kein Feedback gibst, dann wird der Inhalt gelöscht sobald das nächste Artefakt erkannt wurde.",
    "什么特别的备注吗？也可以留空。": "Irgendwelche speziellen Informationen? Du kannst dieses Feld auch leer lassen.",
    "取消": "Abbrechen",
    "发送": "Senden",
    "单击识别启用": "Auf Klick erkennen",
    "单击识别禁用": "Manuell erkennen",
    "打开自动切换器": "Öffne automatischen Wechsler",
    "开启单击识别": "Aktiviere Auf-Klick-Erkennen",
    "关闭单击识别": "Deaktiviere Auf-Klick-Erkennen",
    "请以窗口模式打开游戏背包圣遗物界面， 将本窗口拖动至游戏上方并调节大小，使圣遗物每项属性恰好位于对应框内。完成调整后，请点击下方按钮或者使用热键（~）开始识别。": "Bitte öffne Genshin Impact im Fenstermodus und öffne die Artefaktseite. Ziehe und verändere die Größe dieses Fensters zu dem Ort, wo jedes Attribut in der richtigen Box ist. Nutze den Hotkey (~) zum starten.",
    "开始": "Start",
    "识别错了？点此反馈": "Falsche Antwort? Klicke hier um Feedback abzugeben",
    "识别中": "Erkannt",
    "识别成功": "Erfolgreich",
    "修改成功": "Geändert",
    "删除成功": "Gelöscht",
    "疑似有误": "Wahrscheinlich falsch",
    "识别失败": "Fehlgeschlagen",
    "感谢您的反馈": "Danke fürs melden",
    "数据已提交，我们将尽快检查与改进。": "Feedback wurde erfolgreich gesendet. Wir werden das überprüfen und versuchen es bald zu verbessern.",
    "属性值": "Nebenattribut-Wert",
    "属性名": "Nebenattribut-Name",
    "主词条值": "Hauptattribut-Wert",
    "主词条名": "Hauptattribut-Name",
    "暂无副词条": "Keine Nebenattribute",
    "尝试检测": "Erkenne",
    "新版本:": "Neue Version:",
    "更新": "Upgrade",
    "您的系统似乎没有启用Aero，识别功能可能无法正常使用。": "Scanner funktioniert eventuell nicht, weil die Aero-Oberfläche nicht aktiviert ist.",
    "提示": "Tipps",
    "仍然尝试": "Trotzdem fortfahren",
    "前往下载": "Weiter zum Download",
    "您的系统似乎没有安装微软运行库 (下载地址：https://aka.ms/vs/16/release/vc_redist.x64.exe) ，识别功能将无法正常使用。": "Scanner funktioniert eventuell nicht, weil Microsoft Visual C++ Redistributable (Link: https://aka.ms/vs/16/release/vc_redist.x64.exe) nicht installiert ist.",
    "加速滚动": "Beschleunige Scrollen",
    "如果出现翻页时滚动过快跳过行的情况，或您正在高延迟环境下使用云游戏，请关闭此项。": "Bitte deaktiviere das, wenn einige Reihen übersprungen werden, weil die Scrollgeschwindigkeit zu schnell ist oder du Cloud-Gaming-Plattformen mit hoher Latenz benutzt.",
    "升级智能判断": "Aufwertungserkennung",
    "自动判断圣遗物升级(Beta)，但为什么总是女仆狂喜呢？": "Ersetze automatisch aufgewertete Artefakte.",
    "（可能导致极少量圣遗物不入库）": "(Kann dazu führen, dass eine kleine Anzahl an Artefakten übersprungen wird.)",
    "手柄模拟": "Joystick-Simulation",
    "启用手柄模拟": "Aktiviere Joystick-Simulation",
    "启用后，程序将模拟一个Xbox手柄。圣遗物切换器将使用模拟的手柄进行切换。": "Dieses Programm wird einen XBOX Controller simulieren, wenn diese Option aktiviert ist, um die Artefakte wechseln zu können.",
    "您需要先启用此功能再启动游戏，而后在游戏内设置控制模式为手柄。": "Du musst dies aktivieren, bevor das Spiel gestartet wird. Danach, setze den „Steuerungstyp“ zu „Controller“ in dem Spiel.",
    "为提供简单操作的能力，以下按键映射将被启用：ABXY为键盘的对应按键，左右肩键为PageUP与PageDown，Esc可打开派蒙菜单，摇杆由键盘方向键控制。": "Um zu vermeiden, dass die Kontrolle des Spiels verloren geht, werden diese Tastenbelegungen aktiviert:\nA: A, B: B, X:X, Y:Y, LT: Bild auf; RT: Bild ab; Menü: Esc; Joystick: Pfeiltasten",
    "复制": "Kopiere",
    "手柄模式": "Joystick-Modus",
    "已识别 %1 个": "%1 gescannt",
    "该版本暂不支持自动更新": "Automatisches Update ist in dieser Version nicht unterstützt.",
    "请下载并安装ViGEm驱动 (https://vigem.org/) 以使用手柄模拟功能。": "Bitte downloade und installiere den ViGem-Treiber (https://vigem.org/) um die Joystick-Simulation zu aktivieren.",
    "关闭": "Schließen"
}