{
    "语言(Language)": "Language(语言)",
    "椰羊cocogoat": "Cocogoat",
    "圣遗物": "Artifacts",
    "占卜铺": "Optimizer",
    "悬浮地图": "Floating Map",
    "地图": "Map",
    "设置": "Options",
    "添加": "Add",
    "导出": "Export",
    "修改": "Edit",
    "删除": "Delete",
    "清空": "Delete all",
    "识别": "Recognize",
    "确定": "YES",
    "保存": "Save",
    "重置": "Reset",
    "算了": "Later",
    "删除选中": "Delete selected",
    "取消选择": "Clear selection",
    "到文件": "To file",
    "圣遗物仓库": "Artifacts",
    "真的要清空吗？": "Do you really want to delete all?",
    "正在打开圣遗物识别工具": "Opening artifact scanning tool",
    "点击右上角按钮，打开悬浮地图": "Click the button in the top right to open the floating map",
    "请确保原神已经运行": "Please ensure Genshin Impact is running.",
    "导出成功": "Data exported",
    "莫娜占卜铺": "Mona's Divination Shop",
    "Mingyulab": "Mingyulab",
    "Genshin Optimizer": "Genshin Optimizer",
    "(由 @wormtql 开发，已授权)": "(Developed & Copyrighted by @wormtql)",
    "正在敲开伟大占星术士的家门...": "Knocking on the door of an astrologer prodigy...",
    "已复制到剪贴板": "Results copied to clipboard.",
    "编辑圣遗物": "Edit artifact",
    "添加圣遗物": "Add artifact",
    "副词条": "Substats",
    "添加副词条": "Add substat",
    "基础": "Basic",
    "检查更新": "Check for updates",
    "已经是最新版本": "You're already on the latest version",
    "这些选项将在程序重启后生效。": "The options below will take effects after a reload.",
    "发送错误日志，协助我们改进程序": "Send error reports to help us fixing bugs",
    "启用OCR识别错误反馈功能": "Show feedback button on OCR page",
    "这些选项将在下次打开识别器或切换器时生效。": "The options below will take effects when you open recognizor or switcher next time.",
    "保留重复识别": "Keep identical artifacts",
    "得到两个完全一致的圣遗物的概率是多少呢？": "Enable this if you wish to keep artifacts with identical stats.",
    "独立切换模式": "Standalone switcher",
    "允许在关闭识别器时，保留切换器窗口以配合其他工具使用。": "Enable this to use the switcher standalone or work with third party softwares.",
    "圣遗物切换器每次点击（并识别完成）后切换到下一个的间隔。": "The delay before switching to the next artifact after scanning one.",
    "可用于人工检查识别准确性，或关闭识别器窗口并配合其他工具使用。": "Useful if you want to check errors manually or use standalone switcher with other tools. ",
    "自动切换延迟": "Auto switching delay",
    "关于": "About us",
    "秒": "second(s)",
    "一个简单的原神工具箱，保证每一行代码都是加班打造。是半仙之兽。": "A simple toolbox for Genshin Impact with every line of code made by working overtime.",
    "工作…工作还没做完…真的可以提前休息吗？": "Should we really be off work this early? There is still a lot left to do...",
    "趴在草地上，能听见大地的心跳...": "If you lie on the grass, you can feel the heartbeat of the world.",
    "开发模式无法自动更新": "Autoupgrade is disabled in development mode.",
    "窗口状态数据": "Window state data",
    "清除保存的窗口数据": "Reset saved window size and position",
    "这在你找不到悬浮窗时或许有用。": "May be useful when you can't find the overlay windows.",
    "窗口状态数据已清除": "Successfully resetted window state data",
    "登录信息数据": "Saved login data",
    "清除保存的登录信息": "Clear saved login data",
    "这将清除大地图的登录信息和本地标点等": "This will remove saved login information, local map markers, etc.",
    "登录信息已清除": "Login information cleared",
    "欢迎使用椰羊cocogoat": "Welcome to Cocogoat",
    "这是一个简单的原神工具箱，提供圣遗物识别等便利功能。": "This is a toolbox for Genshin Impact featuring artifacts exporting and so on.",
    "在开始之前，有一些事项需要征求您的同意...": "There's something you need to check before we start.",
    "保存后，您可以随时在设置页面更改这些选项，但需要重启程序生效。除此之外，本程序会在每次启动时自动检查新版本，但需要您手动确认才会进行更新。点击开始使用按钮，代表您同意以上内容。": "You can change those settings anytime after saving in the Options page, but they will take effects after a reload. Besides these, this application checks for updates automatically everytime it starts. Clicking the button below means you agree what's written here.",
    "保存并开始使用": "Save and Start",
    "无法确认行列数量。请确认圣遗物列表的顶部对齐某一行的顶端，且当前页不是最后一页，或换到暗处并重新打开背包。": "Can't confirm number of rows and columns. Please check if the top of artifacts list aligns to the top of a row of artifacts and current page is not the last page, or go to a dark place and reopen your backpack.",
    "请确保您已经使切换器窗口恰好包围圣遗物列表区域。如始终提示出错，请提交反馈。": "Please make sure you let the switcher fittingly surrounds the list of artifacts area. If you are always prompted for an error, submit feedback.",
    "圣遗物切换器": "Aritifact switcher",
    "如鼠标无法选中本窗口，请按热键(~)": "If your mouse cannot select this window, please press the hotkey (~).",
    "正在检测": "Detecting",
    "正在切换": "Switching",
    "正在翻页": "Paging",
    "准备中": "Preparing",
    "，按热键(~)停止": ", press hotkey (~) to stop.",
    "检测失败": "Detection failed",
    "当前页 %1 个  总第 %2 / %3 个": "%1 in current page, Total %2 / %3",
    "反馈识别错误": "Report errors",
    "反馈识别信息将会发送以下内容到我们的服务器：": "The feedback will send the following content to our server:",
    "本次抓取到的圣遗物图片": "The picture of this artifact",
    "您设备的屏幕分辨率和dpi": "The screen resolution and DPI of your device",
    "本地OCR识别结果与纠错尝试": "Local OCR recognition results and error correction attempts",
    "您在下方填写的备注文字信息": "The note text you fill in below",
    "若您不主动向我们反馈，这些内容都会在识别下一个圣遗物后被删除。": "If you do not provide feedback to us, these contents will be removed after the next artifact is recognized.",
    "有什么特别的备注吗？也可以留空。": "Any special information? You can also leave it blank.",
    "取消": "Cancel",
    "发送": "Send",
    "单击识别启用": "Recognize on click",
    "单击识别禁用": "Manual recognize",
    "打开自动切换器": "Open auto switcher",
    "开启单击识别": "Enable recognize-on-click",
    "关闭单击识别": "Disable recognize-on-click",
    "请以窗口模式打开游戏背包圣遗物界面， 将本窗口拖动至游戏上方并调节大小，使圣遗物每项属性恰好位于对应框内。完成调整后，请点击下方按钮或者使用热键（~）开始识别。": "Please open Genshin in window mode and open the artifact page, drag and resize this window to where each attribute in the right box. Then use the button below or hotkey (~) to start.",
    "开始": "Start",
    "大地图": "Map",
    "识别错了？点此反馈": "Wrong answer? Click here to feedback",
    "识别中": "Recognizing",
    "识别成功": "Success",
    "修改成功": "Modified",
    "删除成功": "Deleted",
    "疑似有误": "Maybe wrong",
    "识别失败": "Failed",
    "感谢您的反馈": "Thanks for reporting",
    "数据已提交，我们将尽快检查与改进。": "Feedback sent successfully, we will check and try to imporve soon.",
    "属性值": "Substat value",
    "属性名": "Substat key",
    "主词条值": "Main stat value",
    "主词条名": "Main stat key",
    "暂无副词条": "No substats",
    "尝试检测": "Detect",
    "新版本:": "New version:",
    "更新": "Upgrade",
    "您的系统似乎没有启用Aero，识别功能可能无法正常使用。": "Scanner may not work because Aero is not enabled.",
    "提示": "Tips",
    "仍然尝试": "Continue anyway",
    "前往下载": "Proceed to download",
    "您的系统似乎没有安装微软运行库 (下载地址：https://aka.ms/vs/16/release/vc_redist.x64.exe) ，识别功能将无法正常使用。": "Scanner may not work because Microsoft Visual C++ Redistributable (Link: https://aka.ms/vs/16/release/vc_redist.x64.exe) is not installed.",
    "加速滚动": "Speedup Scrolling",
    "如果出现翻页时滚动过快跳过行的情况，或您正在高延迟环境下使用云游戏，请关闭此项。": "Please disable this if some lines are skipped because of scrolling too fast or you're using cloud gaming platforms with a high latency.",
    "升级智能判断": "Upgrade detection",
    "自动判断圣遗物升级(Beta)，但为什么总是女仆狂喜呢？": "Automatically replace upgraded artifacts.",
    "（可能导致极少量圣遗物不入库）": "(May cause a very few number of artifacts skipped.)",
    "手柄模拟": "Joystick simulating",
    "启用手柄模拟": "Enable joystick simulating",
    "启用后，程序将模拟一个Xbox手柄。圣遗物切换器将使用模拟的手柄进行切换。": "The program will simulate a Xbox Controller when this option is enabled, which will be used in the artifact switcher.",
    "您需要先启用此功能再启动游戏，而后在游戏内设置控制模式为手柄。": "You need to enable this before starting the game. Then, set the \"Control Type\" to \"Controller\" in the game.",
    "为提供简单操作的能力，以下按键映射将被启用：ABXY为键盘的对应按键，左右肩键为PageUP与PageDown，Esc可打开派蒙菜单，摇杆由键盘方向键控制。": "To prevent loss of control of the game, these key mappings will be enabled:\nA: A, B: B, X:X, Y:Y, LT: Page Up; RT: Page Down; Menu: ESC; Joystick: Arrow Keys",
    "复制": "Copy",
    "手柄模式": "Joystick mode",
    "已识别 %1 个": "%1 scanned",
    "该版本暂不支持自动更新": "Auto upgrade is not supported in this wersion.",
    "请下载并安装ViGEm驱动 (https://vigem.org/) 以使用手柄模拟功能。": "Please download and install the ViGem Driver (https://vigem.org/) to enable joystick simulation.",
    "关闭": "Close"
}
