{
    "语言(Language)": "Idioma (语言)",
    "椰羊cocogoat": "Cocogoat",
    "圣遗物": "Artefatos",
    "占卜铺": "Otimizador",
    "设置": "Opções",
    "添加": "Adicionar",
    "导出": "Exportar",
    "修改": "Editar",
    "删除": "Excluir",
    "清空": "Excluir todos",
    "识别": "Reconhecer",
    "确定": "Sim",
    "保存": "Salvar",
    "重置": "Resetar",
    "算了": "Depois",
    "删除选中": "Excluir selecionados",
    "取消选择": "Limpar seleção",
    "到文件": "Para arquivo",
    "圣遗物仓库": "Artefatos",
    "真的要清空吗？": "Você realmente quer excluir todos?",
    "正在打开圣遗物识别工具": "Abrindo ferramenta de escaneamento de artefato",
    "请确保原神已经运行": "Certifique-se de que o jogo está sendo executado.",
    "导出成功": "Dados exportados",
    "已复制到剪贴板": "Resultados copiados.",
    "编辑圣遗物": "Editar artefato",
    "添加圣遗物": "Adicionar artefato",
    "副词条": "Substats",
    "添加副词条": "Adicionar substat",
    "基础": "Básico",
    "检查更新": "Verificar atualizações",
    "已经是最新版本": "Você está usando a última versão",
    "这些选项将在程序重启后生效。": "As opções abaixo terão efeito após abrir novamente.",
    "发送错误日志，协助我们改进程序": "Envie relatórios de erros e ajude a corrigir bugs",
    "启用OCR识别错误反馈功能": "Mostrar botão de feedback na página de reconhecimento",
    "这些选项将在下次打开识别器或切换器时生效。": "As opções abaixo terão efeito quando você abrir o reconhecedor ou trocador na próxima vez.",
    "保留重复识别": "Manter artefatos idênticos",
    "得到两个完全一致的圣遗物的概率是多少呢？": "Ative se deseja manter artefatos com atributos idênticos.",
    "独立切换模式": "Trocador autônomo",
    "允许在关闭识别器时，保留切换器窗口以配合其他工具使用。": "Ative se deseja usar o trocador autônomo ou outro software.",
    "圣遗物切换器每次点击（并识别完成）后切换到下一个的间隔。": "O tempo de espera antes de trocar para o próximo artefato após um escaneamento.",
    "可用于人工检查识别准确性，或关闭识别器窗口并配合其他工具使用。": "Útil se você deseja checar erros manualmente ou utilizar o trocador autônomo com outras ferramentas. ",
    "自动切换延迟": "Tempo de espera da troca automática",
    "关于": "Sobre nós",
    "秒": "segundo(s)",
    "一个简单的原神工具箱，保证每一行代码都是加班打造。是半仙之兽。": "Uma caixa de ferramentas para Genshin Impact com cada linha de código escrita nas horas extras.",
    "工作…工作还没做完…真的可以提前休息吗？": "Devemos parar tão cedo? Ainda tem muito trabalho a se fazer...",
    "趴在草地上，能听见大地的心跳...": "Se você deitar na grama, conseguirá sentir o coração do mundo batendo.",
    "开发模式无法自动更新": "Atualização automática está desabilitada no modo de desenvolvedor.",
    "窗口状态数据": "Dados do estado da janela",
    "清除保存的窗口数据": "Redefinir tamanho e posição da janela",
    "这在你找不到悬浮窗时或许有用。": "Pode ser útil quando não conseguir encontrar as janelas de sobreposição.",
    "窗口状态数据已清除": "Dados de estado da janela redefinidos com sucesso",
    "欢迎使用椰羊cocogoat": "Bem-vindo à Cocogoat",
    "这是一个简单的原神工具箱，提供圣遗物识别等便利功能。": "Essa é uma caixa de ferramentas para Genshin Impact, incluindo a exportação de artefatos e mais.",
    "在开始之前，有一些事项需要征求您的同意...": "Há algo que precisa ser checado antes de começarmos.",
    "保存后，您可以随时在设置页面更改这些选项，但需要重启程序生效。除此之外，本程序会在每次启动时自动检查新版本，但需要您手动确认才会进行更新。点击开始使用按钮，代表您同意以上内容。": "Você pode mudar essas configurações a qualquer momento após salvar nas Opções, mas terão efeito após reiniciar o aplicativo. Além disso, atualizações são checadas automaticamente ao iniciar. Clicar no botão abaixo significa que você concorda com o que está escrito aqui.",
    "保存并开始使用": "Salvar e Começar",
    "无法确认行列数量。请确认圣遗物列表的顶部对齐某一行的顶端，且当前页不是最后一页，或换到暗处并重新打开背包。": "Não foi possível confirmar o número de linhas e colunas. Por favor verifique se o topo da lista de artefatos está alinhada ao topo de uma das linhas de artefatos e que a página atual não seja a última, ou vá para um local escuro e reabra o inventário.",
    "请确保您已经使切换器窗口恰好包围圣遗物列表区域。如始终提示出错，请提交反馈。": "Por favor certifique-se de deixar o trocador em volta da lista de artefatos. Se continuar recebendo erros, envie um feedback.",
    "圣遗物切换器": "Trocador de artefatos",
    "如鼠标无法选中本窗口，请按热键(~)": "Se não conseguir selecionar essa janela, pressione o atalho (~).",
    "正在检测": "Detectando",
    "正在切换": "Trocando",
    "正在翻页": "Paginando",
    "准备中": "Preparando",
    "，按热键(~)停止": ", pressione o atalho (~) para parar.",
    "检测失败": "Detecção falhou",
    "当前页 %1 个  总第 %2 / %3 个": "%1 na página atual, Total %2 / %3",
    "反馈识别错误": "Reportar erros",
    "反馈识别信息将会发送以下内容到我们的服务器：": "O feedback irá enviar o seguinte conteúdo ao nosso servidor:",
    "本次抓取到的圣遗物图片": "Imagem desse artefato",
    "您设备的屏幕分辨率和dpi": "A resolução da tela e DPI do seu dispositivo",
    "本地OCR识别结果与纠错尝试": "Resultados do reconhecimento de texto local e tentativas de correção de erros",
    "您在下方填写的备注文字信息": "O texto da nota você preenche abaixo",
    "若您不主动向我们反馈，这些内容都会在识别下一个圣遗物后被删除。": "Se não fornecer feedback, esses conteúdos serão removidos após o próximo artefato ser reconhecido.",
    "什么特别的备注吗？也可以留空。": "Alguma informação extra? Você pode deixar em branco.",
    "取消": "Cancelar",
    "发送": "Enviar",
    "单击识别启用": "Reconhecer ao clicar",
    "单击识别禁用": "Reconhecer manualmente",
    "打开自动切换器": "Abrir trocador automático",
    "开启单击识别": "Ativar \"reconhecer ao clicar\"",
    "关闭单击识别": "Desativar \"reconhecer ao clicar\"",
    "请以窗口模式打开游戏背包圣遗物界面， 将本窗口拖动至游戏上方并调节大小，使圣遗物每项属性恰好位于对应框内。完成调整后，请点击下方按钮或者使用热键（~）开始识别。": "Abra o jogo no modo janela e abra a página de artefatos, arraste e redimensione esta janela para o local dos atributos do lado direito. Use o botão abaixo ou o atalho (~) para iniciar.",
    "开始": "Iniciar",
    "识别错了？点此反馈": "Errado? Envie um feedback",
    "识别中": "Reconhecendo",
    "识别成功": "Sucesso",
    "修改成功": "Modificado",
    "删除成功": "Excluído",
    "疑似有误": "Talvez esteja errado",
    "识别失败": "Falha",
    "感谢您的反馈": "Obrigado pelo relatório",
    "数据已提交，我们将尽快检查与改进。": "Feedback enviado com sucesso, vamos verificar e tentar melhorar em breve.",
    "属性值": "Valor do substat",
    "属性名": "Nome do substat",
    "主词条值": "Valor do atributo principal",
    "主词条名": "Nome do atributo principal",
    "暂无副词条": "Sem substats",
    "尝试检测": "Detectar",
    "新版本:": "Nova versão:",
    "更新": "Atualizar",
    "您的系统似乎没有启用Aero，识别功能可能无法正常使用。": "O escaneamento pode não funcionar porque Aero está desativado.",
    "提示": "Dicas",
    "仍然尝试": "Continuar mesmo assim",
    "前往下载": "Prosseguir para o download",
    "您的系统似乎没有安装微软运行库 (下载地址：https://aka.ms/vs/16/release/vc_redist.x64.exe) ，识别功能将无法正常使用。": "O escaneamento pode não funcionar porque o Microsoft Visual C++ Redistributable (Link: https://aka.ms/vs/16/release/vc_redist.x64.exe) não está instalado.",
    "加速滚动": "",
    "如果出现翻页时滚动过快跳过行的情况，或您正在高延迟环境下使用云游戏，请关闭此项。": "",
    "升级智能判断": "",
    "自动判断圣遗物升级(Beta)，但为什么总是女仆狂喜呢？": "",
    "（可能导致极少量圣遗物不入库）": "",
    "手柄模拟": "",
    "启用手柄模拟": "",
    "启用后，程序将模拟一个Xbox手柄。圣遗物切换器将使用模拟的手柄进行切换。": "",
    "您需要先启用此功能再启动游戏，而后在游戏内设置控制模式为手柄。": "",
    "为提供简单操作的能力，以下按键映射将被启用：ABXY为键盘的对应按键，左右肩键为PageUP与PageDown，Esc可打开派蒙菜单，摇杆由键盘方向键控制。": "",
    "复制": "",
    "手柄模式": "",
    "已识别 %1 个": ""
}