/**
 * 圣遗物主词条表
 */
export const ArtifactParamTypes = [
    '暴击率',
    '暴击伤害',
    '攻击力',
    '元素精通',
    '元素充能效率',
    '生命值',
    '防御力',
    '物理伤害加成',
    '治疗加成',
    '岩元素伤害加成',
    '风元素伤害加成',
    '冰元素伤害加成',
    '水元素伤害加成',
    '火元素伤害加成',
    '雷元素伤害加成',
]
/**
 * 圣遗物副词条表
 */
export const ArtifactSubParamTypes = [
    '暴击率',
    '暴击伤害',
    '攻击力',
    '元素精通',
    '元素充能效率',
    '生命值',
    '防御力',
    '物理伤害加成',
    '治疗加成',
]
export const ArtifactPositionNames = ['生之花', '死之羽', '时之沙', '空之杯', '理之冠']
const ArtifactNameLists = [
    ['行者之心', '故人之心', '归乡之羽', '逐光之石', '异国之盏', '感别之冠'],
    ['勇士之心', '勇士的勋章', '勇士的期许', '勇士的坚毅', '勇士的壮行', '勇士的冠冕'],
    ['守护之心', '守护之花', '守护徽印', '守护座钟', '守护之皿', '守护束带'],
    ['奇迹', '奇迹之花', '奇迹之羽', '奇迹之沙', '奇迹之杯', '奇迹耳坠'],
    ['战狂', '战狂的蔷薇', '战狂的翎羽', '战狂的时计', '战狂的骨杯', '战狂的鬼面'],
    ['武人', '武人的红花', '武人的羽饰', '武人的水漏', '武人的酒杯', '武人的头巾'],
    ['教官', '教官的胸花', '教官的羽饰', '教官的怀表', '教官的茶杯', '教官的帽子'],
    ['赌徒', '赌徒的胸花', '赌徒的羽饰', '赌徒的怀表', '赌徒的骰盅', '赌徒的耳环'],
    ['流放者', '流放者之花', '流放者之羽', '流放者怀表', '流放者之杯', '流放者头冠'],
    ['冒险家', '冒险家之花', '冒险家尾羽', '冒险家怀表', '冒险家金杯', '冒险家头带'],
    ['幸运儿', '幸运儿绿花', '幸运儿鹰羽', '幸运儿沙漏', '幸运儿之杯', '幸运儿银冠'],
    ['学士', '学士的书签', '学士的羽笔', '学士的时钟', '学士的墨杯', '学士的镜片'],
    ['游医', '游医的银莲', '游医的枭羽', '游医的怀钟', '游医的药壶', '游医的方巾'],
    ['冰封迷途的勇士', '历经风雪的思念', '摧冰而行的执望', '冰雪故园的终期', '遍结寒霜的傲骨', '破冰踏雪的回音'],
    ['平息鸣雷的尊者', '平雷之心', '平雷之羽', '平雷之刻', '平雷之器', '平雷之冠'],
    ['渡过烈火的贤人', '渡火者的决绝', '渡火者的解脱', '渡火者的煎熬', '渡火者的醒悟', '渡火者的智慧'],
    ['被怜爱的少女', '远方的少女之心', '少女飘摇的思念', '少女苦短的良辰', '少女片刻的闲暇', '少女易逝的芳颜'],
    ['角斗士的终幕礼', '角斗士的留恋', '角斗士的归宿', '角斗士的希冀', '角斗士的酣醉', '角斗士的凯旋'],
    ['翠绿之影', '野花记忆的绿野', '猎人青翠的箭羽', '翠绿猎人的笃定', '翠绿猎人的容器', '翠绿的猎人之冠'],
    ['流浪大地的乐团', '乐团的晨光', '琴师的箭羽', '终幕的时计', '吟游者之壶', '指挥的礼帽'],
    ['如雷的盛怒', '雷鸟的怜悯', '雷灾的孑遗', '雷霆的时计', '降雷的凶兆', '唤雷的头冠'],
    ['炽烈的炎之魔女', '魔女的炎之花', '魔女常燃之羽', '魔女破灭之时', '魔女的心之火', '焦灼的魔女帽'],
    ['昔日宗室之仪', '宗室之花', '宗室之翎', '宗室时计', '宗室银瓮', '宗室面具'],
    ['染血的骑士道', '染血的铁之心', '染血的黑之羽', '骑士染血之时', '染血骑士之杯', '染血的铁假面'],
    ['祭火之人', '', '', '', '', '祭火礼冠'],
    ['祭水之人', '', '', '', '', '祭水礼冠'],
    ['祭雷之人', '', '', '', '', '祭雷礼冠'],
    ['祭冰之人', '', '', '', '', '祭冰礼冠'],
    ['悠古的磐岩', '磐陀裂生之花', '嵯峨群峰之翼', '星罗圭璧之晷', '巉岩琢塑之樽', '不动玄石之相'],
    ['逆飞的流星', '夏祭之花', '夏祭终末', '夏祭之刻', '夏祭水玉', '夏祭之面'],
    ['沉沦之心', '饰金胸花', '追忆之风', '坚铜罗盘', '沉波之盏', '酒渍船帽'],
    ['千岩牢固', '勋绩之花', '昭武翎羽', '金铜时晷', '盟誓金爵', '将帅兜鍪'],
    ['苍白之火', '无垢之花', '贤医之羽', '停摆之刻', '超越之盏', '嗤笑之面'],
    ['追忆之注连', '羁缠之花', '思忆之矢', '朝露之时', '祈望之心', '无常之面'],
    ['绝缘之旗印', '明威之镡', '切落之羽', '雷云之笼', '绯花之壶', '华饰之兜'],
    ['华馆梦醒形骸记', '荣花之期', '华馆之羽', '众生之谣', '梦醒之瓢', '形骸之笠'],
    ['海染砗磲', '海染之花', '渊宫之羽', '离别之贝', '真珠之笼', '海祇之冠'],
]
/**
 * 圣遗物名表
 */
export const ArtifactNames: string[] = []
export const ArtifactSetNames: string[] = []
export const ArtifactPositionLists: string[][] = [[], [], [], [], []]
export const ArtifactToSetPosition = new Map<string, string[]>()
for (const oneSet of ArtifactNameLists) {
    ArtifactSetNames.push(oneSet[0])
    for (let i = 1; i <= 5; i++)
        if (oneSet[i].length) {
            ArtifactNames.push(oneSet[i])
            ArtifactPositionLists[i - 1].push(oneSet[i])
            ArtifactToSetPosition.set(oneSet[i], [oneSet[0], ArtifactPositionNames[i - 1]])
        }
}
export const ArtifactNamesAll: string[] = [
    ...ArtifactNames,
    ...(Object.values(require('@/i18n/locales/en_artifacts.json').names) as string[]),
]
export const ArtifactParamTypesAll: string[] = [
    ...ArtifactParamTypes,
    ...(Object.values(require('@/i18n/locales/en_artifacts.json').params) as string[]),
]
/**
 *  圣遗物使用者表
 */
export const ArtifactUsers = [
    '空已装备',
    '荧已装备',
    '安柏已装备',
    '凯亚已装备',
    '丽莎已装备',
    '琴已装备',
    '可莉已装备',
    '诺艾尔已装备',
    '芭芭拉已装备',
    '温迪已装备',
    '雷泽已装备',
    '迪卢克已装备',
    '班尼特已装备',
    '菲谢尔已装备',
    '北斗已装备',
    '凝光已装备',
    '香菱已装备',
    '行秋已装备',
    '重云已装备',
    '砂糖已装备',
    '莫娜已装备',
    '刻晴已装备',
    '七七已装备',
    '达达利亚已装备',
    '迪奥娜已装备',
    '钟离已装备',
    '辛焱已装备',
    '阿贝多已装备',
    '甘雨已装备',
    '魈已装备',
    '胡桃已装备',
    '罗莎莉亚已装备',
]
